In [119]:
import pandas as pd
import numpy as np

In [2]:
df = pd.read_csv('/Users/zakaria/anaconda3/ML-Material/Random_Notebook/Data/developer_survey_2020/survey_results_public.csv')
schama_df = pd.read_csv('/Users/zakaria/anaconda3/ML-Material/Random_Notebook/Data/developer_survey_2020/survey_results_schema.csv')

## Pandas Options

In [3]:
pd.set_option('display.max_columns', 10)
pd.set_option('display.max_rows',10)
pd.set_option('display.notebook_repr_html', True)
pd.set_option('display.float_format', '{:.2f}'.format)
# pd.options.display.float_format ='{:.2f}'.format

In [4]:
df.head(3)

,Respondent,MainBranch,Hobbyist,Age,Age1stCode,...,WebframeWorkedWith,WelcomeChange,WorkWeekHrs,YearsCode,YearsCodePro
0,1,I am a developer by profession,Yes,nan,13,...,ASP.NET;ASP.NET Core,Just as welcome now as I felt last year,50.00,36,27
1,2,I am a developer by profession,No,nan,19,...,NaN,Somewhat more welcome now than last year,nan,7,4
2,3,I code primarily as a hobby,Yes,nan,15,...,NaN,Somewhat more welcome now than last year,nan,4,NaN

## set_index, reset_index

In [5]:
people = {
    "First": ["Zakaria", 'Hanna', 'John'], 
    "Last": ["Hasan", 'Lahtinen', 'Doe'], 
    "Email": ["ZakariaHasn@gmail.com", 'HannaLahtinen@email.com', 'JohnDoe@email.com']
}
df_people = pd.DataFrame(people)

In [6]:
df_people.set_index('Email',inplace=True)

In [7]:
df_people

                           First      Last
Email
ZakariaHasn@gmail.com    Zakaria     Hasan
HannaLahtinen@email.com    Hanna  Lahtinen
JohnDoe@email.com           John       Doe

In [8]:
df_people.reset_index(inplace=True)
df_people

                     Email    First      Last
0    ZakariaHasn@gmail.com  Zakaria     Hasan
1  HannaLahtinen@email.com    Hanna  Lahtinen
2        JohnDoe@email.com     John       Doe

## Index and Column Operation

In [9]:
people = {
    "First": ["Zakaria", 'Hanna', 'John'], 
    "Last": ["Hasan", 'Lahtinen', 'Doe'], 
    "Email": ["ZakariaHasn@gmail.com", 'HannaLahtinen@email.com', 'JohnDoe@email.com']
}
df_people = pd.DataFrame(people)

In [10]:
df_people

     First      Last                    Email
0  Zakaria     Hasan    ZakariaHasn@gmail.com
1    Hanna  Lahtinen  HannaLahtinen@email.com
2     John       Doe        JohnDoe@email.com

In [11]:
# To change the columns name with loop
df_people.columns = [i.lower() for i in df_people.columns]
df_people

     first      last                    email
0  Zakaria     Hasan    ZakariaHasn@gmail.com
1    Hanna  Lahtinen  HannaLahtinen@email.com
2     John       Doe        JohnDoe@email.com

In [12]:
# changing columns name maulally
df_people.columns = ['First_name','Last_name','Email']

In [13]:
df_people

  First_name Last_name                    Email
0    Zakaria     Hasan    ZakariaHasn@gmail.com
1      Hanna  Lahtinen  HannaLahtinen@email.com
2       John       Doe        JohnDoe@email.com

In [14]:
df_people.columns = df_people.columns.str.replace('_',' ')
df_people

  First name Last name                    Email
0    Zakaria     Hasan    ZakariaHasn@gmail.com
1      Hanna  Lahtinen  HannaLahtinen@email.com
2       John       Doe        JohnDoe@email.com

In [15]:
# Changing it back to original 
df_people.columns = ['first','last','email']

## loc and iloc

In [16]:
# iloc is exclusive which mean exclude the last number
df_people.iloc[0:2,2]

0      ZakariaHasn@gmail.com
1    HannaLahtinen@email.com
Name: email, dtype: object

In [17]:
# iloc is inclusive which mean it include the last number
df_people.loc[0:2,'last']

0       Hasan
1    Lahtinen
2         Doe
Name: last, dtype: object

In [18]:
df_people.loc[0:2,['last','first']]

       last    first
0     Hasan  Zakaria
1  Lahtinen    Hanna
2       Doe     John

In [19]:
df_people.loc[[0,2],['last','first']]

    last    first
0  Hasan  Zakaria
2    Doe     John

In [20]:
schama_df

                Column                                       QuestionText
0           Respondent  Randomized respondent ID number (not in order ...
1           MainBranch  Which of the following options best describes ...
2             Hobbyist                            Do you code as a hobby?
3                  Age  What is your age (in years)? If you prefer not...
4           Age1stCode  At what age did you write your first line of c...
..                 ...                                                ...
56  WebframeWorkedWith  Which web frameworks have you done extensive d...
57       WelcomeChange  Compared to last year, how welcome do you feel...
58         WorkWeekHrs  On average, how many hours per week do you wor...
59           YearsCode  Including any education, how many years have y...
60        YearsCodePro  NOT including education, how many years have y...

[61 rows x 2 columns]

In [21]:
schama_df.set_index('Column',inplace=True)

In [22]:
# To see the full description of the column
schama_df.loc['MiscTechDesireNextYear','QuestionText']

'Which other frameworks, libraries, and tools have you done extensive development work in over the past year, and which do you want to work in over the next year? (If you both worked with the framework and want to continue to do so, please check both boxes in that row.)'

In [23]:
schama_df.sort_index(ascending =False, inplace=True)
schama_df[:5]

                                                         QuestionText
Column
YearsCodePro        NOT including education, how many years have y...
YearsCode           Including any education, how many years have y...
WorkWeekHrs         On average, how many hours per week do you wor...
WelcomeChange       Compared to last year, how welcome do you feel...
WebframeWorkedWith  Which web frameworks have you done extensive d...

## Filtering - Using Conditions to Filter Rows and Columns

In [24]:
# Filter or boolean mask 
(df_people['first'] == 'Zakaria')

0     True
1    False
2    False
Name: first, dtype: bool

In [25]:
filt=(df_people['first'] == 'Zakaria')

In [26]:
df_people.loc[filt]

     first   last                  email
0  Zakaria  Hasan  ZakariaHasn@gmail.com

In [27]:
df_people.loc[filt,'email']

0    ZakariaHasn@gmail.com
Name: email, dtype: object

In [28]:
df_people.loc[filt,['email','first']]

                   email    first
0  ZakariaHasn@gmail.com  Zakaria

In [29]:
df_people.loc[~filt,['email','first']]

                     email  first
1  HannaLahtinen@email.com  Hanna
2        JohnDoe@email.com   John

In [30]:
# pandas use (& | ~) as operator insted of python (and, or not) operator 
filt = (df_people['first']=='Zakaria') & (df_people['last']== 'Hasan')

In [31]:
df_people.loc[filt]

     first   last                  email
0  Zakaria  Hasan  ZakariaHasn@gmail.com

In [32]:
# pandas use (& | ~) as operator insted of python (and, or not) operator 
filt = (df_people['first']=='Zakaria') | (df_people['last']== 'Doe')

In [33]:
df_people.loc[filt]

     first   last                  email
0  Zakaria  Hasan  ZakariaHasn@gmail.com
2     John    Doe      JohnDoe@email.com

In [34]:
df.columns

Index(['Respondent', 'MainBranch', 'Hobbyist', 'Age', 'Age1stCode', 'CompFreq',
       'CompTotal', 'ConvertedComp', 'Country', 'CurrencyDesc',
       'CurrencySymbol', 'DatabaseDesireNextYear', 'DatabaseWorkedWith',
       'DevType', 'EdLevel', 'Employment', 'Ethnicity', 'Gender', 'JobFactors',
       'JobSat', 'JobSeek', 'LanguageDesireNextYear', 'LanguageWorkedWith',
       'MiscTechDesireNextYear', 'MiscTechWorkedWith',
       'NEWCollabToolsDesireNextYear', 'NEWCollabToolsWorkedWith', 'NEWDevOps',
       'NEWDevOpsImpt', 'NEWEdImpt', 'NEWJobHunt', 'NEWJobHuntResearch',
       'NEWLearn', 'NEWOffTopic', 'NEWOnboardGood', 'NEWOtherComms',
       'NEWOvertime', 'NEWPurchaseResearch', 'NEWPurpleLink', 'NEWSOSites',
       'NEWStuck', 'OpSys', 'OrgSize', 'PlatformDesireNextYear',
       'PlatformWorkedWith', 'PurchaseWhat', 'Sexuality', 'SOAccount',
       'SOComm', 'SOPartFreq', 'SOVisitFreq', 'SurveyEase', 'SurveyLength',
       'Trans', 'UndergradMajor', 'WebframeDesireNextYear',
       'WebframeWorkedWith', 'WelcomeChange', 'WorkWeekHrs', 'YearsCode',
       'YearsCodePro'],
      dtype='object')

In [35]:
high_salary_filter = (df['ConvertedComp'] > 70000)
df.loc[high_salary_filter,['Country','ConvertedComp']].sort_values('ConvertedComp',ascending=False)

             Country  ConvertedComp
32286  United States     2000000.00
44459  United States     2000000.00
44449  United States     2000000.00
1018   United States     2000000.00
52366  United States     2000000.00
...              ...            ...
15275    Netherlands       70044.00
41600         Israel       70044.00
43204        Bahrain       70020.00
5438       Australia       70017.00
57750  United States       70008.00

[13178 rows x 2 columns]

In [36]:
countries = ['United States','Netherlands','Australia','Bahrain']
countries_filter = df['Country'].isin(countries)
countries_filter[:4]

0    False
1    False
2    False
3    False
Name: Country, dtype: bool

In [37]:
df.loc[countries_filter,['Country','Hobbyist','Age']].reset_index(drop=True).loc[:5]

         Country Hobbyist   Age
0  United States      Yes 31.00
1  United States      Yes 36.00
2    Netherlands      Yes 53.00
3  United States      Yes 27.00
4  United States      Yes 25.00
5  United States      Yes 32.00

## Stirng filter

In [38]:
 df['LanguageWorkedWith'].head(5)

0      C#;HTML/CSS;JavaScript
1            JavaScript;Swift
2    Objective-C;Python;Swift
3                         NaN
4           HTML/CSS;Ruby;SQL
Name: LanguageWorkedWith, dtype: object

In [39]:
# value with nan gives error. that why we declar na=False
filt = df['LanguageWorkedWith'].str.contains('Python',na=False)
filt[:5]

0    False
1    False
2     True
3    False
4    False
Name: LanguageWorkedWith, dtype: bool

In [40]:
df.loc[filt].head(2)

,Respondent,MainBranch,Hobbyist,Age,Age1stCode,...,WebframeWorkedWith,WelcomeChange,WorkWeekHrs,YearsCode,YearsCodePro
2,3,I code primarily as a hobby,Yes,nan,15,...,NaN,Somewhat more welcome now than last year,nan,4,NaN
7,8,I am a developer by profession,Yes,36.00,12,...,Flask,Just as welcome now as I felt last year,39.00,17,13

In [41]:
# To see the total python user
df['LanguageWorkedWith'].str.contains('Python',na=False).sum()

25287

## Groupby

In [42]:
df.groupby('Country')['Country'].count().sort_values(ascending=False).iloc[:5]

Country
United States     12469
India              8403
United Kingdom     3896
Germany            3890
Canada             2191
Name: Country, dtype: int64

## shape, value_counts and count

In [43]:
df.head(2)

,Respondent,MainBranch,Hobbyist,Age,Age1stCode,...,WebframeWorkedWith,WelcomeChange,WorkWeekHrs,YearsCode,YearsCodePro
0,1,I am a developer by profession,Yes,nan,13,...,ASP.NET;ASP.NET Core,Just as welcome now as I felt last year,50.00,36,27
1,2,I am a developer by profession,No,nan,19,...,NaN,Somewhat more welcome now than last year,nan,7,4

In [44]:
# shape attribute count the total number of rows and columns
df.shape

(64461, 61)

In [45]:
# value_counts 
print(df['Hobbyist'].value_counts())
print('-----------------------------')
# value_counts with percent
print(df['Hobbyist'].value_counts(normalize=True))

Yes    50388
No     14028
Name: Hobbyist, dtype: int64
-----------------------------
Yes   0.78
No    0.22
Name: Hobbyist, dtype: float64

In [46]:
# count() function count the total rows without nan values
print(df['Hobbyist'].count())
# shape attribute count the total number of rows and columns
print(df['Hobbyist'].shape[0])

64416
64461

In [47]:
# To see the n number of largest value
df['ConvertedComp'].nlargest(10)

121    2000000.00
123    2000000.00
191    2000000.00
663    2000000.00
697    2000000.00
722    2000000.00
816    2000000.00
982    2000000.00
1018   2000000.00
1032   2000000.00
Name: ConvertedComp, dtype: float64

In [48]:
df.nlargest(3,'ConvertedComp')

,Respondent,MainBranch,Hobbyist,Age,Age1stCode,...,WebframeWorkedWith,WelcomeChange,WorkWeekHrs,YearsCode,YearsCodePro
121,123,I am a developer by profession,Yes,26.00,12,...,Spring,Just as welcome now as I felt last year,36.00,8,3
123,125,"I am not primarily a developer, but I write co...",Yes,41.00,30,...,NaN,Just as welcome now as I felt last year,40.00,11,11
191,193,I am a developer by profession,Yes,29.00,16,...,NaN,Just as welcome now as I felt last year,40.00,13,7

In [49]:
df.nlargest(3,'ConvertedComp')[['DevType','Age','YearsCode']]

                                               DevType   Age YearsCode
121          Developer, back-end;Developer, full-stack 26.00         8
123  Data scientist or machine learning specialist;... 41.00        11
191                                  Developer, mobile 29.00        13

In [50]:
# To see the nsmallest value
df.nsmallest(3,'ConvertedComp')[['DevType','Age','YearsCode']]

                                               DevType   Age YearsCode
122                         Designer;Developer, mobile 38.00        24
236  Academic researcher;Data scientist or machine ...   nan         4
882  Developer, back-end;Developer, embedded applic... 41.00        25

## Updating Rows and Columns - Modifying data within DataFrames

In [51]:
df_people

     first      last                    email
0  Zakaria     Hasan    ZakariaHasn@gmail.com
1    Hanna  Lahtinen  HannaLahtinen@email.com
2     John       Doe        JohnDoe@email.com

In [52]:
# Updating person whole record with loc
df_people.loc[2] = ['John','Smith','JohnSmith@email.com']
df_people

     first      last                    email
0  Zakaria     Hasan    ZakariaHasn@gmail.com
1    Hanna  Lahtinen  HannaLahtinen@email.com
2     John     Smith      JohnSmith@email.com

In [53]:
# Updating person partial record with loc
df_people.loc[2,['last','email']] = ['Doe','JohnDoe@email.com']
df_people

     first      last                    email
0  Zakaria     Hasan    ZakariaHasn@gmail.com
1    Hanna  Lahtinen  HannaLahtinen@email.com
2     John       Doe        JohnDoe@email.com

In [54]:
# updating person partial record with boolean mask
filt =(df_people['email']=='JohnDoe@email.com')
df_people.loc[filt,'last'] = 'Smith'
df_people

     first      last                    email
0  Zakaria     Hasan    ZakariaHasn@gmail.com
1    Hanna  Lahtinen  HannaLahtinen@email.com
2     John     Smith        JohnDoe@email.com

In [55]:
# To Manupulate the whole column
df_people['email'].str.lower()

0      zakariahasn@gmail.com
1    hannalahtinen@email.com
2          johndoe@email.com
Name: email, dtype: object

In [56]:
df_people

     first      last                    email
0  Zakaria     Hasan    ZakariaHasn@gmail.com
1    Hanna  Lahtinen  HannaLahtinen@email.com
2     John     Smith        JohnDoe@email.com

In [57]:
df_people['email'] = df_people['email'].str.lower()
df_people

     first      last                    email
0  Zakaria     Hasan    zakariahasn@gmail.com
1    Hanna  Lahtinen  hannalahtinen@email.com
2     John     Smith        johndoe@email.com

## Four methods of DataFrame and Series manipulation
- apply : Apply work for both Series and DataFrame. For Series it works elementwise and for DF work as aggregation function
- applymap : applymap is elementwise for DataFrame. Works on DataFrame omly
- map : map operate on one element at time at Series only
- replace : It replace the match and leave other untouch where map's dic replace matches and put non matches to nan

Quick Summary

- DataFrame.apply operates on entire rows or columns at a time. takes callable only
- DataFrame.applymap, Series.apply, and Series.map operate on one element at time.
- Series.apply and Series.map are similar and often interchangeable. map take Dic and callable

In [58]:
df_people

     first      last                    email
0  Zakaria     Hasan    zakariahasn@gmail.com
1    Hanna  Lahtinen  hannalahtinen@email.com
2     John     Smith        johndoe@email.com

In [59]:
df_people['email'].apply(len)

0    21
1    23
2    17
Name: email, dtype: int64

In [60]:
df_people['email'].map(len)

0    21
1    23
2    17
Name: email, dtype: int64

In [61]:
df_people[['first','last']].applymap(len)

   first  last
0      7     5
1      5     8
2      4     5

In [62]:
df_people.apply(len)

first    3
last     3
email    3
dtype: int64

## Add/Remove Rows and Columns From DataFrames

In [63]:
df_people['Full_Name'] = df_people['first']+' '+df_people['last']

In [64]:
df_people

     first      last                    email       Full_Name
0  Zakaria     Hasan    zakariahasn@gmail.com   Zakaria Hasan
1    Hanna  Lahtinen  hannalahtinen@email.com  Hanna Lahtinen
2     John     Smith        johndoe@email.com      John Smith

In [65]:
# Dropping columns
df_people.drop(columns=['first','last'],inplace=True)

In [66]:
df_people

                     email       Full_Name
0    zakariahasn@gmail.com   Zakaria Hasan
1  hannalahtinen@email.com  Hanna Lahtinen
2        johndoe@email.com      John Smith

In [67]:
# Expanding single column into two with str.split(,expand=True)
df_people[['first','last']]=df_people['Full_Name'].str.split(' ',expand=True)

In [68]:
df_people

                     email       Full_Name    first      last
0    zakariahasn@gmail.com   Zakaria Hasan  Zakaria     Hasan
1  hannalahtinen@email.com  Hanna Lahtinen    Hanna  Lahtinen
2        johndoe@email.com      John Smith     John     Smith

In [69]:
# To append a single row, ignore_index = True must be provided
df_people.append({'first':'Tony'},ignore_index=True)

                     email       Full_Name    first      last
0    zakariahasn@gmail.com   Zakaria Hasan  Zakaria     Hasan
1  hannalahtinen@email.com  Hanna Lahtinen    Hanna  Lahtinen
2        johndoe@email.com      John Smith     John     Smith
3                      NaN             NaN     Tony       NaN

In [70]:
people = {
    'first': ['Tony', 'Steve'], 
    'last': ['Stark', 'Rogers'], 
    'email': ['IronMan@avenge.com', 'Cap@avenge.com']
}
df2_people = pd.DataFrame(people)

In [71]:
 df2_people

   first    last               email
0   Tony   Stark  IronMan@avenge.com
1  Steve  Rogers      Cap@avenge.com

In [72]:
df_people

                     email       Full_Name    first      last
0    zakariahasn@gmail.com   Zakaria Hasan  Zakaria     Hasan
1  hannalahtinen@email.com  Hanna Lahtinen    Hanna  Lahtinen
2        johndoe@email.com      John Smith     John     Smith

In [73]:
df_people.append( df2_people,ignore_index=True,sort=False)

                     email       Full_Name    first      last
0    zakariahasn@gmail.com   Zakaria Hasan  Zakaria     Hasan
1  hannalahtinen@email.com  Hanna Lahtinen    Hanna  Lahtinen
2        johndoe@email.com      John Smith     John     Smith
3       IronMan@avenge.com             NaN     Tony     Stark
4           Cap@avenge.com             NaN    Steve    Rogers

In [74]:
df_people

                     email       Full_Name    first      last
0    zakariahasn@gmail.com   Zakaria Hasan  Zakaria     Hasan
1  hannalahtinen@email.com  Hanna Lahtinen    Hanna  Lahtinen
2        johndoe@email.com      John Smith     John     Smith

In [75]:
# To save the appened data tothe dataframe, because there is no inplace in append
df_people=df_people.append( df2_people,ignore_index=True,sort=False)
df_people

                     email       Full_Name    first      last
0    zakariahasn@gmail.com   Zakaria Hasan  Zakaria     Hasan
1  hannalahtinen@email.com  Hanna Lahtinen    Hanna  Lahtinen
2        johndoe@email.com      John Smith     John     Smith
3       IronMan@avenge.com             NaN     Tony     Stark
4           Cap@avenge.com             NaN    Steve    Rogers

## Sorting and showing value with nlargest and nsmallest

In [76]:
df_10 = pd.DataFrame({'population': [59000000, 65000000, 434000,
                                  434000, 434000, 337000, 11300,
                                  11300, 11300],
                   'GDP': [1937894, 2583560 , 12011, 4520, 12128,
                            17036, 182, 38, 311],
                    'alpha-2': ["IT", "FR", "MT", "MV", "BN",
                               "IS", "NR", "TV", "AI"]},
                   index=["Italy", "France", "Malta",
                          "Maldives", "Brunei", "Iceland",
                          "Nauru", "Tuvalu", "Anguilla"])

In [77]:
df_10

          population      GDP alpha-2
Italy       59000000  1937894      IT
France      65000000  2583560      FR
Malta         434000    12011      MT
Maldives      434000     4520      MV
Brunei        434000    12128      BN
Iceland       337000    17036      IS
Nauru          11300      182      NR
Tuvalu         11300       38      TV
Anguilla       11300      311      AI

In [78]:
df_10['population'].nlargest(3)

France    65000000
Italy     59000000
Malta       434000
Name: population, dtype: int64

In [79]:
df_10.nlargest(3, 'population')

        population      GDP alpha-2
France    65000000  2583560      FR
Italy     59000000  1937894      IT
Malta       434000    12011      MT

In [80]:
df_10.nsmallest(3, 'population')

          population  GDP alpha-2
Nauru          11300  182      NR
Tuvalu         11300   38      TV
Anguilla       11300  311      AI

##  Grouping and Aggregation

In [81]:
df_10.describe(percentiles=[0.1,0.2,0.3,0.4]).transpose()

,count,mean,std,min,10%,20%,30%,40%,50%,max
population,9.00,13963655.56,27275964.54,11300.00,11300.00,11300.00,141580.00,356400.00,434000.00,65000000.00
GDP,9.00,507520.00,1007014.69,38.00,153.20,259.40,1994.60,6018.20,12011.00,2583560.00

In [93]:
country_group = df.groupby('Country')
country_group

In [92]:
country_group.get_group('United Kingdom').head(4)

,Respondent,MainBranch,Hobbyist,Age,Age1stCode,...,WebframeWorkedWith,WelcomeChange,WorkWeekHrs,YearsCode,YearsCodePro
1,2,I am a developer by profession,No,nan,19,...,NaN,Somewhat more welcome now than last year,nan,7,4
9,10,I am a developer by profession,Yes,22.00,14,...,Flask;jQuery,Somewhat more welcome now than last year,36.00,8,4
10,11,I am a developer by profession,Yes,23.00,13,...,Angular;Angular.js;Django;React.js,Just as welcome now as I felt last year,40.00,10,2
15,16,I am a developer by profession,Yes,45.00,8,...,jQuery;React.js,Just as welcome now as I felt last year,50.00,37,23

In [100]:
df.groupby(['Country'])[['Age','Hobbyist']].count().head(5)

             Age  Hobbyist
Country
Afghanistan   22        84
Albania       30        54
Algeria       51        94
Andorra        3        13
Angola         3         9

In [102]:
df.groupby(['Country'])[['Age','Hobbyist']].min().head(5)

              Age Hobbyist
Country
Afghanistan 15.00       No
Albania     16.00       No
Algeria     15.00       No
Andorra     30.00       No
Angola      22.00       No

In [104]:
arrays = [['Falcon', 'Falcon', 'Parrot', 'Parrot'],
           ['Captive', 'Wild', 'Captive', 'Wild']]

In [107]:
index = pd.MultiIndex.from_arrays(arrays, names=('Animal', 'Type'))
index

MultiIndex([('Falcon', 'Captive'),
            ('Falcon',    'Wild'),
            ('Parrot', 'Captive'),
            ('Parrot',    'Wild')],
           names=['Animal', 'Type'])

In [113]:
df_a = pd.DataFrame({'Max Speed': [390., 350., 30., 20.]},
                  index=index)
df_a

                Max Speed
Animal Type
Falcon Captive     390.00
       Wild        350.00
Parrot Captive      30.00
       Wild         20.00

In [114]:
df_a.groupby(level=0).mean()

        Max Speed
Animal
Falcon     370.00
Parrot      25.00

In [115]:
l = [[1, 2, 3], [1, None, 4], [2, 1, 3], [1, 2, 2]]
df_b = pd.DataFrame(l, columns=["a", "b", "c"])
df_b

   a    b  c
0  1 2.00  3
1  1  nan  4
2  2 1.00  3
3  1 2.00  2

In [116]:
df_b.groupby(by=["b"]).sum()

      a  c
b
1.00  2  3
2.00  2  5

In [117]:
df_b.groupby(by=["b"], dropna=False).sum()

      a  c
b
1.00  2  3
2.00  2  5
nan   1  4

In [121]:
 df_c = pd.DataFrame({'B': [0, 1, 2, np.nan, 4]})
df_c

     B
0 0.00
1 1.00
2 2.00
3  nan
4 4.00

In [124]:
df_c.rolling(3, win_type='triang').sum()

     B
0  nan
1  nan
2 2.00
3  nan
4  nan